app/controllers/newsblogs_controller.rb

  def index
    per_page = params[:per_page] ||= PER_PAGE
    @newsblogs = Newsblog.paginate :page => params[:page],
                          :per_page => params[:per_page],
                          :order=>'created_at DESC'
---
SELECT "newsblogs".* FROM "newsblogs" ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def show
    begin
      @newsblog = Newsblog.find(params[:id])
---
SELECT "newsblogs".* FROM "newsblogs" WHERE "newsblogs"."id" = 1 LIMIT 1

  def feed
    # this will be the name of the feed displayed on the feed reader
    @title = "CSA News Feed"

    # the news items
    @newsblogs = Newsblog.order("updated_at desc")

    # this will be our Feed's update timestamp
    @updated = @newsblogs.first.updated_at unless @newsblogs.empty?
---
SELECT "newsblogs".* FROM "newsblogs" ORDER BY updated_at desc LIMIT 1
SELECT COUNT(*) FROM "newsblogs"