app/controllers/users_controller.rb

  def index
    @users = User.paginate :page => params[:page],
                           :per_page => params[:per_page],
                           :order=>'surname, firstname'
---
SELECT "users".* FROM "users" ORDER BY surname, firstname LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    begin
  	  @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1